# Packages to install on OSX with Homebrew
# Just run `brew bundle --global install`

# Globally-required taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# GNU core utilities
# Don't forget to add the "gnubin" directories to the beginning of your $PATH (check the "caveats" sections for the paths)
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "moreutils"

# More recent versions of OSX-incuded tools
brew "ack"
brew "bash"
brew "curl"
brew "gawk"
brew "git"
brew "gnupg"
brew "less"
brew "openssh"
brew "p7zip"
brew "python"
brew "rename"
brew "ruby"
brew "screen"
brew "tree"
brew "zsh"

# Terminal environment
brew "asdf"
brew "direnv"
cask "font-fira-code"
brew "fzf"
brew "gh"
brew "htop"
brew "hub"
cask "iterm2"
brew "neovim"
brew "pinentry-mac"
brew "shellcheck"
brew "ripgrep"
brew "tig"
brew "tmux"

# Shell completions
brew "bash-completion"
brew "pip-completion"
brew "ruby-completion"

# Dependencies for programs installed outside of Homebrew
brew "cmake"
brew "go"
