# Packages to install on OSX with Homebrew
# Just run `brew bundle --global install`

# Globally-required taps
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"

# GNU core utilities
# Don't forget to add the "gnubin" directories to the beginning of your $PATH (check the "caveats" sections for the paths)
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "moreutils"

# More recent versions of OSX-incuded tools
brew "ack"
brew "bash"
brew "curl"
brew "gawk"
brew "git"
brew "gnupg"
brew "less"
brew "openssh"
brew "p7zip"
brew "python"
brew "rename"
brew "ruby"
brew "screen"
brew "tree"
brew "vim"
brew "zsh"

# Useful tools
brew "direnv"
brew "fzf"
brew "htop"
brew "hub"
brew "jq"
brew "markdown"
brew "ncdu"
brew "neovim"
brew "p7zip"
brew "pinentry-mac"
brew "pv"
brew "shellcheck"
brew "switchaudio-osx"
brew "telnet"
brew "tig"
brew "tmux"
brew "unzip"
brew "watch"
brew "wget"
brew "yq"
brew "zshdb"

# New Github CLI
tap "github/gh"
brew "github/gh/gh"

# Shell completions
brew "bash-completion"
brew "pip-completion"
brew "rake-completion"
brew "ruby-completion"
brew "vagrant-completion"

# Useful GUI programs
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "keka"
cask "macdown"
cask "macvim"
cask "vlc"

# Dependencies for programs installed outside of Homebrew
brew "cmake"
brew "go"
brew "haskell-stack"
