{
  "Colorizer": { "branch": "master" },
  "SimpylFold": { "branch": "master" },
  "auto-git-diff": { "branch": "master" },
  "bufexplorer": { "branch": "master" },
  "deoplete.nvim": { "branch": "master" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "gist-vim": { "branch": "master" },
  "indentLine": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "neomake": { "branch": "master" },
  "nerdtree": { "branch": "master" },
  "nerdtree-git-plugin": { "branch": "master" },
  "nvim-base16": { "branch": "master" },
  "open-browser.vim": { "branch": "master" },
  "quick-scope": { "branch": "master" },
  "targets.vim": { "branch": "master" },
  "undotree": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-airline": { "branch": "master" },
  "vim-argumentative": { "branch": "master" },
  "vim-better-whitespace": { "branch": "master" },
  "vim-checkbox": { "branch": "change-map" },
  "vim-commentary": { "branch": "master" },
  "vim-easy-align": { "branch": "master" },
  "vim-easymotion": { "branch": "master" },
  "vim-endwise": { "branch": "master" },
  "vim-eunuch": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-git": { "branch": "master" },
  "vim-gitgutter": { "branch": "master" },
  "vim-go": { "branch": "master" },
  "vim-indent-object": { "branch": "master" },
  "vim-json": { "branch": "master" },
  "vim-markdown-folding": { "branch": "master" },
  "vim-markdown-preview": { "branch": "default_browser_assumption" },
  "vim-peekaboo": { "branch": "master" },
  "vim-renamer": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rhubarb": { "branch": "master" },
  "vim-sort-motion": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-textobj-comment": { "branch": "master" },
  "vim-textobj-fold": { "branch": "master" },
  "vim-textobj-indented-paragraph": { "branch": "master" },
  "vim-textobj-markdown": { "branch": "master" },
  "vim-textobj-ruby": { "branch": "master" },
  "vim-textobj-user": { "branch": "master" },
  "vim-tmux-navigator": { "branch": "master" },
  "vim-windowswap": { "branch": "master" },
  "vim-winmanip": { "branch": "master" },
  "vim-yaml-folds": { "branch": "master" },
  "webapi-vim": { "branch": "master" }
}